function subjecfeature = importfile(filename, startRow, endRow)
%IMPORTFILE 将文本文件中的数值数据作为矩阵导入。
%   SUBJECFEATURE = IMPORTFILE(FILENAME) 读取文本文件 FILENAME 中默认选定范围的数据。
%
%   SUBJECFEATURE = IMPORTFILE(FILENAME, STARTROW, ENDROW) 读取文本文件 FILENAME
%   的 STARTROW 行到 ENDROW 行中的数据。
%
% Example:
%   subjecfeature = importfile('subjec_feature.csv', 1, 5267);
%
%    另请参阅 TEXTSCAN。

% 由 MATLAB 自动生成于 2022/10/22 16:41:33

%% 初始化变量。
delimiter = ',';
if nargin<=2
    startRow = 1;
    endRow = inf;
end

%% 每个文本行的格式:
%   列1: 双精度值 (%f)
%	列2: 双精度值 (%f)
%   列3: 双精度值 (%f)
%	列4: 双精度值 (%f)
%   列5: 双精度值 (%f)
%	列6: 双精度值 (%f)
%   列7: 双精度值 (%f)
%	列8: 双精度值 (%f)
%   列9: 双精度值 (%f)
%	列10: 双精度值 (%f)
%   列11: 双精度值 (%f)
%	列12: 双精度值 (%f)
%   列13: 双精度值 (%f)
%	列14: 双精度值 (%f)
%   列15: 双精度值 (%f)
%	列16: 双精度值 (%f)
%   列17: 双精度值 (%f)
%	列18: 双精度值 (%f)
%   列19: 双精度值 (%f)
%	列20: 双精度值 (%f)
%   列21: 双精度值 (%f)
%	列22: 双精度值 (%f)
%   列23: 双精度值 (%f)
%	列24: 双精度值 (%f)
%   列25: 双精度值 (%f)
%	列26: 双精度值 (%f)
%   列27: 双精度值 (%f)
%	列28: 双精度值 (%f)
%   列29: 双精度值 (%f)
%	列30: 双精度值 (%f)
%   列31: 双精度值 (%f)
%	列32: 双精度值 (%f)
%   列33: 双精度值 (%f)
%	列34: 双精度值 (%f)
%   列35: 双精度值 (%f)
%	列36: 双精度值 (%f)
%   列37: 双精度值 (%f)
%	列38: 双精度值 (%f)
%   列39: 双精度值 (%f)
%	列40: 双精度值 (%f)
%   列41: 双精度值 (%f)
%	列42: 双精度值 (%f)
%   列43: 双精度值 (%f)
%	列44: 双精度值 (%f)
%   列45: 双精度值 (%f)
%	列46: 双精度值 (%f)
%   列47: 双精度值 (%f)
%	列48: 双精度值 (%f)
%   列49: 双精度值 (%f)
%	列50: 双精度值 (%f)
%   列51: 双精度值 (%f)
%	列52: 双精度值 (%f)
%   列53: 双精度值 (%f)
%	列54: 双精度值 (%f)
%   列55: 双精度值 (%f)
%	列56: 双精度值 (%f)
%   列57: 双精度值 (%f)
%	列58: 双精度值 (%f)
%   列59: 双精度值 (%f)
%	列60: 双精度值 (%f)
%   列61: 双精度值 (%f)
%	列62: 双精度值 (%f)
%   列63: 双精度值 (%f)
%	列64: 双精度值 (%f)
%   列65: 双精度值 (%f)
%	列66: 双精度值 (%f)
%   列67: 双精度值 (%f)
%	列68: 双精度值 (%f)
%   列69: 双精度值 (%f)
%	列70: 双精度值 (%f)
%   列71: 双精度值 (%f)
%	列72: 双精度值 (%f)
%   列73: 双精度值 (%f)
%	列74: 双精度值 (%f)
%   列75: 双精度值 (%f)
%	列76: 双精度值 (%f)
%   列77: 双精度值 (%f)
%	列78: 双精度值 (%f)
%   列79: 双精度值 (%f)
%	列80: 双精度值 (%f)
%   列81: 双精度值 (%f)
%	列82: 双精度值 (%f)
%   列83: 双精度值 (%f)
%	列84: 双精度值 (%f)
%   列85: 双精度值 (%f)
%	列86: 双精度值 (%f)
%   列87: 双精度值 (%f)
%	列88: 双精度值 (%f)
%   列89: 双精度值 (%f)
%	列90: 双精度值 (%f)
%   列91: 双精度值 (%f)
%	列92: 双精度值 (%f)
%   列93: 双精度值 (%f)
%	列94: 双精度值 (%f)
%   列95: 双精度值 (%f)
%	列96: 双精度值 (%f)
%   列97: 双精度值 (%f)
%	列98: 双精度值 (%f)
%   列99: 双精度值 (%f)
%	列100: 双精度值 (%f)
%   列101: 双精度值 (%f)
%	列102: 双精度值 (%f)
%   列103: 双精度值 (%f)
%	列104: 双精度值 (%f)
%   列105: 双精度值 (%f)
%	列106: 双精度值 (%f)
%   列107: 双精度值 (%f)
%	列108: 双精度值 (%f)
%   列109: 双精度值 (%f)
%	列110: 双精度值 (%f)
%   列111: 双精度值 (%f)
%	列112: 双精度值 (%f)
%   列113: 双精度值 (%f)
%	列114: 双精度值 (%f)
%   列115: 双精度值 (%f)
%	列116: 双精度值 (%f)
%   列117: 双精度值 (%f)
%	列118: 双精度值 (%f)
%   列119: 双精度值 (%f)
%	列120: 双精度值 (%f)
%   列121: 双精度值 (%f)
%	列122: 双精度值 (%f)
%   列123: 双精度值 (%f)
%	列124: 双精度值 (%f)
%   列125: 双精度值 (%f)
%	列126: 双精度值 (%f)
%   列127: 双精度值 (%f)
%	列128: 双精度值 (%f)
%   列129: 双精度值 (%f)
%	列130: 双精度值 (%f)
%   列131: 双精度值 (%f)
%	列132: 双精度值 (%f)
%   列133: 双精度值 (%f)
%	列134: 双精度值 (%f)
%   列135: 双精度值 (%f)
%	列136: 双精度值 (%f)
%   列137: 双精度值 (%f)
%	列138: 双精度值 (%f)
%   列139: 双精度值 (%f)
%	列140: 双精度值 (%f)
%   列141: 双精度值 (%f)
%	列142: 双精度值 (%f)
%   列143: 双精度值 (%f)
%	列144: 双精度值 (%f)
%   列145: 双精度值 (%f)
%	列146: 双精度值 (%f)
%   列147: 双精度值 (%f)
%	列148: 双精度值 (%f)
%   列149: 双精度值 (%f)
%	列150: 双精度值 (%f)
%   列151: 双精度值 (%f)
%	列152: 双精度值 (%f)
%   列153: 双精度值 (%f)
%	列154: 双精度值 (%f)
%   列155: 双精度值 (%f)
%	列156: 双精度值 (%f)
%   列157: 双精度值 (%f)
%	列158: 双精度值 (%f)
%   列159: 双精度值 (%f)
%	列160: 双精度值 (%f)
%   列161: 双精度值 (%f)
%	列162: 双精度值 (%f)
%   列163: 双精度值 (%f)
%	列164: 双精度值 (%f)
%   列165: 双精度值 (%f)
%	列166: 双精度值 (%f)
%   列167: 双精度值 (%f)
%	列168: 双精度值 (%f)
%   列169: 双精度值 (%f)
% 有关详细信息，请参阅 TEXTSCAN 文档。
formatSpec = '%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%f%[^\n\r]';

%% 打开文本文件。
fileID = fopen(filename,'r');

%% 根据格式读取数据列。
% 该调用基于生成此代码所用的文件的结构。如果其他文件出现错误，请尝试通过导入工具重新生成代码。
dataArray = textscan(fileID, formatSpec, endRow(1)-startRow(1)+1, 'Delimiter', delimiter, 'TextType', 'string', 'EmptyValue', NaN, 'HeaderLines', startRow(1)-1, 'ReturnOnError', false, 'EndOfLine', '\r\n');
for block=2:length(startRow)
    frewind(fileID);
    dataArrayBlock = textscan(fileID, formatSpec, endRow(block)-startRow(block)+1, 'Delimiter', delimiter, 'TextType', 'string', 'EmptyValue', NaN, 'HeaderLines', startRow(block)-1, 'ReturnOnError', false, 'EndOfLine', '\r\n');
    for col=1:length(dataArray)
        dataArray{col} = [dataArray{col};dataArrayBlock{col}];
    end
end

%% 关闭文本文件。
fclose(fileID);

%% 对无法导入的数据进行的后处理。
% 在导入过程中未应用无法导入的数据的规则，因此不包括后处理代码。要生成适用于无法导入的数据的代码，请在文件中选择无法导入的元胞，然后重新生成脚本。

%% 创建输出变量
subjecfeature = [dataArray{1:end-1}];
